var food = [
    {
        "編號": "1",
        "名稱": "涼麵",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "2",
        "名稱": "大腸麵線",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "3",
        "名稱": "豆漿店",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "自由配"
    },
    {
        "編號": "4",
        "名稱": "鹹酥雞",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "自由配"
    },
    {
        "編號": "5",
        "名稱": "飯糰",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "只想吃一點點",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "6",
        "名稱": "壽司",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "只想吃一點點",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "7",
        "名稱": "滷肉飯",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "只想吃一點點",
        "米飯": "好",
        "配菜自由度": "自由配"
    },
    {
        "編號": "8",
        "名稱": "控肉飯",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "只想吃一點點",
        "米飯": "好",
        "配菜自由度": "自由配"
    },
    {
        "編號": "9",
        "名稱": "拉麵",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "10",
        "名稱": "義大利麵",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "11",
        "名稱": "排餐",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "12",
        "名稱": "牛肉麵",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "自由配"
    },
    {
        "編號": "13",
        "名稱": "披薩",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "自由配"
    },
    {
        "編號": "14",
        "名稱": "魚湯",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "15",
        "名稱": "廣東粥",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "16",
        "名稱": "便當",
        "心情": "不好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "自由配"
    },
    {
        "編號": "17",
        "名稱": "炒飯、炒麵",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "自由配"
    },
    {
        "編號": "18",
        "名稱": "河粉",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "19",
        "名稱": "水餃",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "20",
        "名稱": "漢堡",
        "心情": "不好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "21",
        "名稱": "鹽水雞",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "自由配"
    },
    {
        "編號": "22",
        "名稱": "滷味",
        "心情": "不好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "不要",
        "配菜自由度": "自由配"
    },
    {
        "編號": "23",
        "名稱": "韓式拌飯",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "24",
        "名稱": "韓式拌飯",
        "心情": "不好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "25",
        "名稱": "自助餐",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "好",
        "配菜自由度": "自由配"
    },
    {
        "編號": "26",
        "名稱": "燒臘",
        "心情": "不好",
        "蔬菜": "多",
        "分量": "只想吃一點點",
        "米飯": "好",
        "配菜自由度": "自由配"
    },
    {
        "編號": "27",
        "名稱": "鐵板燒",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "28",
        "名稱": "壽喜燒",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "自由配"
    },
    {
        "編號": "29",
        "名稱": "燒肉",
        "心情": "不好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "店家配"
    },
    {
        "編號": "30",
        "名稱": "羊肉爐",
        "心情": "不好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "不要",
        "配菜自由度": "自由配"
    },
    {
        "編號": "31",
        "名稱": "定食",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "32",
        "名稱": "丼飯",
        "心情": "不好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "33",
        "名稱": "臭臭鍋",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "34",
        "名稱": "火鍋",
        "心情": "不好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "自由配"
    },
    {
        "編號": "35",
        "名稱": "廣東粥",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "36",
        "名稱": "炒飯、炒麵",
        "心情": "普通~偏好",
        "蔬菜": "少",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "店家配"
    },
    {
        "編號": "37",
        "名稱": "便當",
        "心情": "普通~偏好",
        "蔬菜": "多",
        "分量": "要吃飽",
        "米飯": "好",
        "配菜自由度": "自由配"
    }
];

let type = ["心情", "蔬菜", "分量", "米飯", "配菜自由度"];

let q1 = ['現在的心情如何呢？', '普通~偏好', '不好'];
let q2 = ['想要吃多一點蔬菜還是少一點好呢？', '多', "少"];
let q3 = ['餐點的分量？', "只想吃一點點", '要吃飽'];
let q4 = ['要吃米飯嗎？', '好', '不要'];
let q5 = ['配菜要店家配好還是自由配呢？', '店家配', "自由配"];

let all = [q1, q2, q3, q4, q5];

let topic = ['topic1', 'topic2', 'topic3', 'topic4', 'topic5'];
let a1 = ['q1_a1', 'q2_a1', 'q3_a1', 'q4_a1', 'q5_a1'];
let a2 = ['q1_a2', 'q2_a2', 'q3_a2', 'q4_a2', 'q5_a2'];

//題目
for (i in topic) {
    document.getElementById(topic[i]).innerHTML = all[i][0];
    document.getElementById(a1[i]).innerHTML = all[i][1];
    document.getElementById(a2[i]).innerHTML = all[i][2];
}

//答案記錄與按鈕動作
let u_choice = [0, 0, 0, 0, 0];
function record(self, i, n, a) {
    u_choice[i] = all[i][n];
    console.log('第' + (i + 1) + '題你選擇了:' + all[i][n]);
    document.getElementById(self[i]).style.border = "3px solid 	#ACD6FF";
    document.getElementById(a[i]).style.border = "none";
}
//----------------- a1 -------------------
document.getElementById(a1[0]).addEventListener('click', function () {
    record(a1, 0, 1, a2);
})
document.getElementById(a1[1]).addEventListener('click', function () {
    record(a1, 1, 1, a2);
})
document.getElementById(a1[2]).addEventListener('click', function () {
    record(a1, 2, 1, a2);
})
document.getElementById(a1[3]).addEventListener('click', function () {
    record(a1, 3, 1, a2);
})
document.getElementById(a1[4]).addEventListener('click', function () {
    record(a1, 4, 1, a2);
})
//----------------- a2 -------------------
document.getElementById(a2[0]).addEventListener('click', function () {
    record(a2, 0, 2, a1);
})
document.getElementById(a2[1]).addEventListener('click', function () {
    record(a2, 1, 2, a1);
})
document.getElementById(a2[2]).addEventListener('click', function () {
    record(a2, 2, 2, a1);
})
document.getElementById(a2[3]).addEventListener('click', function () {
    record(a2, 3, 2, a1);
})
document.getElementById(a2[4]).addEventListener('click', function () {
    record(a2, 4, 2, a1);
})
//-------判斷有沒有每個問題都選------------

function answer(u) {
    let list = [];
    let n = 0;
    for (i in food) {
        if (u[0] == food[i].心情 && u[1] == food[i].蔬菜 && u[2] == food[i].分量 && u[3] == food[i].米飯 && u[4] == food[i].配菜自由度) {
            list[n] = food[i].名稱;
            n++;
        }
    }
    const data=['涼麵','大腸麵線','豆漿店','鹹酥雞','飯糰','壽司','滷肉飯','控肉飯','拉麵','義大利麵','排餐','牛肉麵','披薩','魚湯','廣東粥','炒飯、炒麵','河粉','水餃','漢堡','鹽水雞','滷味','韓式拌飯','自助餐','燒臘','鐵板燒','燒肉','壽喜燒','羊肉爐','定食','丼飯','臭臭鍋','火鍋','便當'];
    const r = parseInt(Math.random() * (list.length));
    console.log(r);
    console.log(list);
    for (i in data){
        if(list[r]==data[i]){
            document.cookie='food='+i;
        }
    }
    //document.cookie='food='+list[r];
    console.log('cookie foood的值是'+getCookie('food'));


}

document.getElementById('enter').addEventListener('click', function () {
    let yet = '';
    let a = 0;
    for (i in u_choice) {
        if (u_choice[i] == 0) {
            a++;
        }
    }
    yet += '還有問題未回答喔！'
    if (a != 0) {
        alert(yet);
    } else {
        console.log(u_choice);
        answer(u_choice);
        setTimeout(() => {
            window.location.href= "game_result.html";
        }, 500);
    }
})

function getCookie(name) {
    var arr, reg = new RegExp("(^| )" + name + "=([^;]*)(;|$)");

    if (arr = document.cookie.match(reg))

        return unescape(arr[2]);
    else
        return null;
} 